app/views/matches/index.html.erb

<h3> Activities:
  <% matched_user.activities.each do |activity| %>
---
SELECT "activities".* FROM "activities" INNER JOIN "activity_blurbs" ON "activities"."id" = "activity_blurbs"."activity_id" WHERE "activity_blurbs"."user_id" = $1  [["user_id", 2]]