tbnamed/app/controllers/matches_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "matches".* FROM "matches" WHERE "matches"."first_user_id" = $1  [["first_user_id", 2]]
SELECT "matches".* FROM "matches" WHERE "matches"."second_user_id" = $1  [["second_user_id", 2]]
---
    def index
      #return JSON of a user's matches profile information
      # render :text => "Match index"
      user = User.find(1)
      match_ids = []
      user.first_user_matches.each do |match|
        match_ids << match.second_user_id
      end
      user.second_user_matches.each do |match|